Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 1) 0                                            
__________________________________________________________________________________________________
prune_low_magnitude_conv2d (Pru (None, 512, 512, 16) 306         input_1[0][0]                    
__________________________________________________________________________________________________
prune_low_magnitude_dropout (Pr (None, 512, 512, 16) 1           prune_low_magnitude_conv2d[0][0] 
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_1 (P (None, 512, 512, 16) 4626        prune_low_magnitude_dropout[0][0]
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 256, 256, 16) 1           prune_low_magnitude_conv2d_1[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_2 (P (None, 256, 256, 32) 9250        prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_dropout_1 ( (None, 256, 256, 32) 1           prune_low_magnitude_conv2d_2[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_3 (P (None, 256, 256, 32) 18466       prune_low_magnitude_dropout_1[0][
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 128, 128, 32) 1           prune_low_magnitude_conv2d_3[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_4 (P (None, 128, 128, 64) 36930       prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_dropout_2 ( (None, 128, 128, 64) 1           prune_low_magnitude_conv2d_4[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_5 (P (None, 128, 128, 64) 73794       prune_low_magnitude_dropout_2[0][
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 64, 64, 64)   1           prune_low_magnitude_conv2d_5[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_6 (P (None, 64, 64, 128)  147586      prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_dropout_3 ( (None, 64, 64, 128)  1           prune_low_magnitude_conv2d_6[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_7 (P (None, 64, 64, 128)  295042      prune_low_magnitude_dropout_3[0][
__________________________________________________________________________________________________
prune_low_magnitude_max_pooling (None, 32, 32, 128)  1           prune_low_magnitude_conv2d_7[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_8 (P (None, 32, 32, 256)  590082      prune_low_magnitude_max_pooling2d
__________________________________________________________________________________________________
prune_low_magnitude_dropout_4 ( (None, 32, 32, 256)  1           prune_low_magnitude_conv2d_8[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_9 (P (None, 32, 32, 256)  1179906     prune_low_magnitude_dropout_4[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_tran (None, 64, 64, 128)  262274      prune_low_magnitude_conv2d_9[0][0
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 64, 64, 256)  1           prune_low_magnitude_conv2d_transp
                                                                 prune_low_magnitude_conv2d_7[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_10 ( (None, 64, 64, 128)  589954      prune_low_magnitude_concatenate[0
__________________________________________________________________________________________________
prune_low_magnitude_dropout_5 ( (None, 64, 64, 128)  1           prune_low_magnitude_conv2d_10[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_11 ( (None, 64, 64, 128)  295042      prune_low_magnitude_dropout_5[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_tran (None, 128, 128, 64) 65602       prune_low_magnitude_conv2d_11[0][
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 128, 128, 128 1           prune_low_magnitude_conv2d_transp
                                                                 prune_low_magnitude_conv2d_5[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_12 ( (None, 128, 128, 64) 147522      prune_low_magnitude_concatenate_1
__________________________________________________________________________________________________
prune_low_magnitude_dropout_6 ( (None, 128, 128, 64) 1           prune_low_magnitude_conv2d_12[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_13 ( (None, 128, 128, 64) 73794       prune_low_magnitude_dropout_6[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_tran (None, 256, 256, 32) 16418       prune_low_magnitude_conv2d_13[0][
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 256, 256, 64) 1           prune_low_magnitude_conv2d_transp
                                                                 prune_low_magnitude_conv2d_3[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_14 ( (None, 256, 256, 32) 36898       prune_low_magnitude_concatenate_2
__________________________________________________________________________________________________
prune_low_magnitude_dropout_7 ( (None, 256, 256, 32) 1           prune_low_magnitude_conv2d_14[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_15 ( (None, 256, 256, 32) 18466       prune_low_magnitude_dropout_7[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_tran (None, 512, 512, 16) 4114        prune_low_magnitude_conv2d_15[0][
__________________________________________________________________________________________________
prune_low_magnitude_concatenate (None, 512, 512, 32) 1           prune_low_magnitude_conv2d_transp
                                                                 prune_low_magnitude_conv2d_1[0][0
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_16 ( (None, 512, 512, 16) 9234        prune_low_magnitude_concatenate_3
__________________________________________________________________________________________________
prune_low_magnitude_dropout_8 ( (None, 512, 512, 16) 1           prune_low_magnitude_conv2d_16[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_17 ( (None, 512, 512, 16) 4626        prune_low_magnitude_dropout_8[0][
__________________________________________________________________________________________________
prune_low_magnitude_conv2d_18 ( (None, 512, 512, 4)  134         prune_low_magnitude_conv2d_17[0][
==================================================================================================
Total params: 3,880,083
Trainable params: 1,940,868
Non-trainable params: 1,939,215
__________________________________________________________________________________________________
