Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 512, 512, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 512, 512, 16) 160         input_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 512, 512, 16) 0           conv2d[1][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 512, 512, 16) 2320        dropout[1][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 256, 256, 16) 0           conv2d_1[1][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 256, 32) 4640        max_pooling2d[1][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256, 256, 32) 0           conv2d_2[1][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 32) 9248        dropout_1[1][0]                  
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 128, 32) 0           conv2d_3[1][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 64) 18496       max_pooling2d_1[1][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 128, 128, 64) 0           conv2d_4[1][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 64) 36928       dropout_2[1][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 64, 64)   0           conv2d_5[1][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 64, 128)  73856       max_pooling2d_2[1][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64, 64, 128)  0           conv2d_6[1][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 128)  147584      dropout_3[1][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 32, 32, 128)  0           conv2d_7[1][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 256)  295168      max_pooling2d_3[1][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32, 32, 256)  0           conv2d_8[1][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 256)  590080      dropout_4[1][0]                  
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 64, 64, 128)  131200      conv2d_9[1][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64, 64, 256)  0           conv2d_transpose[1][0]           
                                                                 conv2d_7[1][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 128)  295040      concatenate[1][0]                
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 64, 128)  0           conv2d_10[1][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 128)  147584      dropout_5[1][0]                  
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 128, 128, 64) 32832       conv2d_11[1][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 128 0           conv2d_transpose_1[1][0]         
                                                                 conv2d_5[1][0]                   
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 64) 73792       concatenate_1[1][0]              
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 128, 128, 64) 0           conv2d_12[1][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 64) 36928       dropout_6[1][0]                  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 256, 256, 32) 8224        conv2d_13[1][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 64) 0           conv2d_transpose_2[1][0]         
                                                                 conv2d_3[1][0]                   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 256, 256, 32) 18464       concatenate_2[1][0]              
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 256, 256, 32) 0           conv2d_14[1][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 256, 256, 32) 9248        dropout_7[1][0]                  
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 512, 512, 16) 2064        conv2d_15[1][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 512, 512, 32) 0           conv2d_transpose_3[1][0]         
                                                                 conv2d_1[1][0]                   
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 512, 512, 16) 4624        concatenate_3[1][0]              
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 512, 512, 16) 0           conv2d_16[1][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 512, 512, 16) 2320        dropout_8[1][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 512, 512, 4)  68          conv2d_17[1][0]                  
==================================================================================================
Total params: 1,940,868
Trainable params: 1,940,868
Non-trainable params: 0
__________________________________________________________________________________________________
